package c_control;

/*
	for(초기값;조건문;증가식)
	{
		반복할 문장들 
	}
*/

public class Ex05_for개념 {

	public static void main(String[] args) {
		for(char c ='Z'; c>='A';c--) {
			System.out.println(c);
		}
	}
		
//==========================================================================		
		
		// A~Z 출력

//		for (char c = 'A'; c <= 'Z'; c++) {
//			System.out.println(c);
//		}
//	}
//==========================================================================
//		int sum = 0, sum2 = 0;
//
//		for (int i = 1; i <= 100; i += 2) {
//			sum += i;
//			sum2 += (i + 1);
//		}
//		System.out.println("짝수의 합 :" + sum);
//		System.out.println("홀수의 합 :" + sum2);
//==========================================================================
//		for (int i = 1; i <= 100; i++) {
//			if (i % 2 == 0) {
//				sum += i;
//
//			} else {
//				sum2 += i;
//			}
//		}
//		System.out.println("짝수의 합 :" + sum);
//		System.out.println("홀수의 합 :" + sum2);
//==========================================================================
	/*
	 * int sum = 0; // 초기 값 설정
	 * 
	 * for (int i = 1; i <= 10; i++) {
	 * 
	 * sum += i; // sum = sum +i;
	 * 
	 * } System.out.println("결과" + sum);
	 * 
	 * }
	 */
	// 1~100 까지의 홀수의 합과 짝수의 합
//==========================================================================
}
